Тест_ЗУП_31_КОРП/src/Catalogs/СобеседникиЧатботов/СобеседникиЧатботов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СобеседникиЧатботов</name>
  <attributes>
    <name>Фамилия</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеИмя</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
</mdclass:Catalog>

Тест_ЗУП_31_КОРП/src/Catalogs/СобеседникиЧатботов/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
#Область СлужебныеПроцедурыИФункции

Функция ОписаниеСобеседника() Экспорт
	
	Описание = Новый Структура(
		"Код, 
		|Имя,
		|Фамилия,
		|КраткоеИмя");
	
	Описание.Код = 0;
	Описание.Имя = "";
	Описание.Фамилия = "";
	Описание.КраткоеИмя = "";
	
	Возврат Описание;
	
КонецФункции

Функция СоздатьСобеседника(Код, Описание = Неопределено) Экспорт
	
	СобеседникСсылка = Справочники.СобеседникиЧатботов.НайтиПоКоду(Код);
	Если Не СобеседникСсылка.Пустая() Тогда
		Возврат СобеседникСсылка;
	КонецЕсли;
	
	Если Описание = Неопределено Тогда
		Описание = ОписаниеСобеседника();
	КонецЕсли;
	
	СобеседникОбъект = Справочники.СобеседникиЧатботов.СоздатьЭлемент();
	ЗаполнитьЗначенияСвойств(СобеседникОбъект, Описание);
	СобеседникОбъект.Код = Код;
	СобеседникОбъект.Наименование = Описание.Имя;
	СобеседникОбъект.Записать();
	
	Возврат СобеседникСсылка;
	
КонецФункции

#КонецОбласти

#КонецЕсли
